//==================================================================================
// 
// ゲームシーンのヘッダーファイル [game.h]
// Author : TENMA SAITO
// Date   : 2026/9/28
// 
//==================================================================================
#ifndef _GAME_H_		// インクルードガード
#define _GAME_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "scene.h"

//**********************************************************************************
// *** タイトルクラス ***
//**********************************************************************************
class CGame : public CSceneBase<CGame, CScene::MODE_GAME>
{
public:
	CGame();
	~CGame();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
	void Start(void);
};
#endif