//==================================================================================
// 
// アイテム生成クラスのヘッダーファイル [title.h]
// Author : TENMA SAITO
// 
//==================================================================================
#ifndef _ITEM_GENERATOR_H_		// インクルードガード
#define _ITEM_GENERATOR_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "object.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CField;

//**********************************************************************************
// *** 定数宣言 ***
//**********************************************************************************
constexpr int ITEM_GENERATOR_PRIORITY = DEFAULT_OBJ_PRIORITY;		// アイテム生成クラスの優先順位

//**********************************************************************************
// *** アイテム生成クラス ***
//**********************************************************************************
class CItemGenerator : public CObject
{
public:
	CItemGenerator(const int nPriority = ITEM_GENERATOR_PRIORITY);
	~CItemGenerator();

	HRESULT Init(void);
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;
	void Notified(CObject *pObject, std::string_view message, const std::any &args) override;

private:
	CField *m_pField = nullptr;			// 床へのポインタ
	int m_nNumItem = 0;		// アイテムの総数
};
#endif