//==================================================================================
// 
// ライトクラスのヘッダーファイル [light.h]
// Author : TENMA SAITO
// Date   : 2026/5/8
// 
//==================================================================================
#ifndef _LIGHT_H_		// インクルードガード
#define _LIGHT_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
// *** 定数宣言 ***
//**********************************************************************************
constexpr int DEFAULT_LIGHT_NUM = 3;	// ライトの基本数

//**********************************************************************************
// *** ライトクラス ***
//**********************************************************************************
class CLight
{
public:
	CLight();
	~CLight();

	void Init(void);
	void Uninit(void);
	void Update(void);
	const D3DLIGHT9 *GetLight(const int nIdx) const { return &m_aLight[nIdx]; }

private:
	D3DLIGHT9 m_aLight[DEFAULT_LIGHT_NUM] = {};		// ライトの情報
	Vector3 m_rot = VECTOR3_NULL;	// 角度
	int m_nIdxLight = -1;			// 現在操作しているライト
};
#endif