//==================================================================================
// 
// 親マトリックスを設定可能なインターフェースのヘッダーファイル [object.h]
// Author : TENMA SAITO
// 
//==================================================================================
#ifndef _IPARENTABLE_H_
#define _IPARENTABLE_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
// *** 親設定インターフェース ***
//**********************************************************************************
struct IParentable
{
	virtual void SetParent(const Matrix *pMtxParent) = 0;
	virtual const Matrix *GetParent(void) const = 0;

protected:
	~IParentable() = default;
};
#endif