//==================================================================================
// 
// プレイヤーカメラクラスのヘッダーファイル [playerCamera.h]
// Author : TENMA SAITO
// 
//==================================================================================
#ifndef _PLAYER_CAMERA_H_		// インクルードガード
#define _PLAYER_CAMERA_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "camera.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CPlayer;

//**********************************************************************************
// *** プレイヤーカメラクラス ***
//**********************************************************************************
class CPlayerCamera : public CCamera
{
public:
	CPlayerCamera();
	~CPlayerCamera();

	static CPlayerCamera *Create(const CPlayer *pPlayer);

	void Init(const CPlayer *pPlayer);
	void Uninit(void) override;
	void Update(void) override;
	void SetCamera(void) override;

private:
	const CPlayer *m_pPlayer = nullptr;		// プレイヤーへのポインタ
};
#endif