//==================================================================================
// 
// プレイヤーカメラクラスのヘッダーファイル [playerCamera.h]
// Author : TENMA SAITO
// 
//==================================================================================
#ifndef _PLAYER_CAMERA_H_		// インクルードガード
#define _PLAYER_CAMERA_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "camera.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CPlayer;

//**********************************************************************************
// *** プレイヤーカメラクラス ***
//**********************************************************************************
class CPlayerCamera : public CCamera
{
public:
	CPlayerCamera();
	~CPlayerCamera();

	static CPlayerCamera *Create(CPlayer *pPlayer);

	void Init(CPlayer *pPlayer);
	void Uninit(void) override;
	void Update(void) override;
	void SetCamera(void) override;

private:
	CPlayer *m_pPlayer = nullptr;		// プレイヤーへのポインタ
	float m_fTheta = 0.0f;		// 上方向ベクトルの角度1
	float m_fPhi = 0.0f;		// 上方向ベクトルの角度2
};
#endif