//==================================================================================
// 
// 通信規則ヘッダファイル [protocol_ranking.h]
// Author : TENMA SAITO
// 
//==================================================================================
#ifndef _PROTOCOL_RANKING_H_
#define _PROTOCOL_RANKING_H_

//**********************************************************************************
// *** 定数宣言 ***
//**********************************************************************************
constexpr int MAX_RANKING = 5;		// ランキングの数
constexpr int UNRANKING = -1;		// ランキングの乗らなかった場合に帰ってくる値

//**********************************************************************************
// *** 通信コマンドの種類 ***
//**********************************************************************************
typedef enum
{
	COMMAND_TYPE_NONE = 0,		// 無し
	COMMAND_TYPE_SET_RANKING,	// ランキング設定
	COMMAND_TYPE_GET_RANKING,	// ランキング取得
	COMMAND_TYPE_MAX
} COMMAND_TYPE;
#endif