//==================================================================================
// 
// ランキングのクライアントクラスのヘッダーファイル [rankingClient.h]
// Author : TENMA SAITO
// Date   : 2026/10/7
// 
//==================================================================================
#ifndef _RANKING_CLIENT_H_		// インクルードガード
#define _RANKING_CLIENT_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include "protocol_ranking.h"

//**********************************************************************************
// *** 前方宣言 ***
//**********************************************************************************
class CTcpClient;

//**********************************************************************************
// *** ランキングのクライアントクラス ***
//**********************************************************************************
class CRankingClient
{
public:
	CRankingClient();
	~CRankingClient();

	HRESULT Init(std::string_view sIPAddress, const u_short nPortID);
	void Uninit(void);
	int Send(const int nScore);
	std::array<int, MAX_RANKING> Get(void);
	
private:
	std::string m_sIPAddress;		// 接続先のIPアドレス
	u_short m_nPortID = 0;			// 接続先のポート番号
};
#endif