//==================================================================================
// 
// TCP送受信クラスのソースファイル [tcp_client.cpp]
// Author : TENMA SAITO
// 
//==================================================================================
//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "tcp_client.h"

//==================================================================================
// --- コンストラクタ ---
//==================================================================================
CTcpClient::CTcpClient()
{
}

//==================================================================================
// --- デストラクタ ---
//==================================================================================
CTcpClient::~CTcpClient()
{
}

//==================================================================================
// --- 初期化処理 ---
//==================================================================================
void CTcpClient::Init(const SOCKET sock, const struct sockaddr_in &client)
{
	// ソケットを保存
	m_sock = sock;

	// クライアントの情報を保存
	m_addr = client;
}

//==================================================================================
// --- 初期化処理 (IPアドレスとポート番号指定) ---
//==================================================================================
int CTcpClient::Init(const char *pIPAddress, const u_short nPortID)
{
	if (pIPAddress == NULL)
	{ // IPアドレスがNULLなら失敗
		return CLIENT_E_INVALID_POINTER;
	}

	// 通信用のソケットを作成
	m_sock = socket(AF_INET, SOCK_STREAM, 0);
	if (m_sock == INVALID_SOCKET)
	{ // ソケット作成失敗
		return CLIENT_E_INVALID_SOCKET;
	}

	// 接続先を指定する構造体
	struct sockaddr_in addr;

	// 接続受付の準備
	addr.sin_family = AF_INET;

	// 接続を受け付けるポート番号を指定
	addr.sin_port = htons(nPortID);

	// 文字列からIPアドレスを取得
	addr.sin_addr.S_un.S_addr = inet_addr(&pIPAddress[0]);

	// サーバーに接続する！
	if (connect(m_sock, (struct sockaddr*)&addr, sizeof(addr)) != 0)
	{ // 接続失敗時
		// ソケットを閉じる
		CloseSocket();

		return CLIENT_E_CONNECTION;
	}

	// 自身の情報を保存
	memcpy(&m_addr, &addr, sizeof(addr));

	// 初期化成功
	return CLIENT_S_FUNCTION;
}

//==================================================================================
// --- 終了処理 ---
//==================================================================================
void CTcpClient::Uninit(void)
{ // ソケットを閉じる
	CloseSocket();
}

//==================================================================================
// --- ソケット切断処理 ---
//==================================================================================
void CTcpClient::CloseSocket(void)
{
	if (m_sock != INVALID_SOCKET)
	{ // ソケットが無効でなければ
		// ソケットを閉じる
		closesocket(m_sock);

		// ソケットを無効にする
		m_sock = INVALID_SOCKET;
		
		// クライアントの情報のクリア
		memset(&m_addr, 0, sizeof(m_addr));
	}
}