//==================================================================================
// 
// タイトルシーンのヘッダーファイル [title.h]
// Author : TENMA SAITO
// 
//==================================================================================
#ifndef _TITLE_H_		// インクルードガード
#define _TITLE_H_

//**********************************************************************************
// *** インクルードファイル ***
//**********************************************************************************
#include "scene.h"

//**********************************************************************************
// *** タイトルクラス ***
//**********************************************************************************
class CTitle : public CSceneBase<CTitle, CScene::MODE_TITLE>
{
public:
	CTitle();
	~CTitle();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
	void Start(void);
};
#endif